### Andrzej Janik 406174
### Ćwiczenie 2 Łączenie z bazą danych i instrukcja select

 # Połączenie z bazą danych przy pomocy sqlAlchemy

In [62]:
import sqlalchemy
from sqlalchemy import create_engine
db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)
connection_sqlalchemy = db.connect()
connection = db.connect()

Zapytanie do bazy i wypisanie wyników

In [63]:
#result_set = db.execute("SELECT * FROM city")
#for r in result_set:
#   print(r)

 # Połączenie z bazą danych przy pomocy psycopg2 i pandas

In [64]:
import psycopg2 as pg
import pandas as pd

#connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

Zapytanie do bazy i wypisanie wyników

In [65]:
df = pd.read_sql('select * from city',con=connection)
df

     city_id                city  country_id         last_update
0          1  A Corua (La Corua)          87 2006-02-15 09:45:25
1          2                Abha          82 2006-02-15 09:45:25
2          3           Abu Dhabi         101 2006-02-15 09:45:25
3          4                Acua          60 2006-02-15 09:45:25
4          5               Adana          97 2006-02-15 09:45:25
..       ...                 ...         ...                 ...
595      596               Zaria          69 2006-02-15 09:45:25
596      597        Zeleznogorsk          80 2006-02-15 09:45:25
597      598         Zhezqazghan          51 2006-02-15 09:45:25
598      599            Zhoushan          23 2006-02-15 09:45:25
599      600          Ziguinchor          83 2006-02-15 09:45:25

[600 rows x 4 columns]

## Połączenie za pomocą sqlAlchemy i pandas

In [66]:
df = pd.read_sql('select * from city', con=connection_sqlalchemy)
df

     city_id                city  country_id         last_update
0          1  A Corua (La Corua)          87 2006-02-15 09:45:25
1          2                Abha          82 2006-02-15 09:45:25
2          3           Abu Dhabi         101 2006-02-15 09:45:25
3          4                Acua          60 2006-02-15 09:45:25
4          5               Adana          97 2006-02-15 09:45:25
..       ...                 ...         ...                 ...
595      596               Zaria          69 2006-02-15 09:45:25
596      597        Zeleznogorsk          80 2006-02-15 09:45:25
597      598         Zhezqazghan          51 2006-02-15 09:45:25
598      599            Zhoushan          23 2006-02-15 09:45:25
599      600          Ziguinchor          83 2006-02-15 09:45:25

[600 rows x 4 columns]

# Wykonanie ćwiczenia
## Zadanie 1
Ile kategorii filmów mamy w wypożyczalni?

In [67]:
df1 =  pd.read_sql('select distinct count(*) from category', con=connection)
print(df1)

   count
0     16

## Zadanie 2
Lista kategorii w kolejności alfabetycznej.

In [68]:
df2 = pd.read_sql('select distinct name from category order by name ASC', con=connection)
print(df2)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

## Zadanie 3
Najstarszy i najmłodszy film do wypożyczenia

In [69]:
df3_1 = pd.read_sql("select title, release_year from film order by release_year asc limit 1", con=connection)
print("Najstarszy film do wypożyczenia")
print(df3_1)

Najstarszy film do wypożyczenia
             title  release_year
0  Chamber Italian          2006

In [70]:
df3_2 = pd.read_sql("select title, release_year from film order by release_year offset 999", con=connection)
print("Najmłodszy film do wypożyczenia")
print(df3_2)

Najmłodszy film do wypożyczenia
       title  release_year
0  Zorro Ark          2006

Filmy są z tego samego roku

## Zadanie 4
Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?

In [71]:
df4 = pd.read_sql("select count(*) from rental where rental_date between '2005-07-01' and '2005-08-01'", con=connection)
print(df4)

   count
0   6709

## Zadanie 5
Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?

In [72]:
df5 = pd.read_sql("select count(*) from rental where rental_date between '2010-01-01' and '2011-02-01'", con=connection)
print(df5)

   count
0      0

## Zadanie 6
Największa płatność wypożyczenia.

In [73]:
df6 = pd.read_sql("select amount from payment where amount = (select max(amount) from payment) limit 1", con=connection)
print(df6)

   amount
0   11.99

## Zadanie 7
Wszyscy klienci z Polski, Nigerii lub Bangladeszu.

In [74]:
df7 = pd.read_sql("select first_name, last_name, country from country left join city on city.country_id = country.country_id left join address on address.city_id = city.city_id left join customer on customer.address_id = address.address_id where country in ('Poland', 'Nigeria', 'Bangladesh') order by customer_id asc", con=connection)
print(df7)

   first_name  last_name     country
0       Carol     Garcia     Nigeria
1    Michelle      Clark  Bangladesh
2     Marilyn       Ross     Nigeria
3      Gladys   Hamilton     Nigeria
4    Marjorie     Tucker      Poland
5      Bertha   Ferguson     Nigeria
6       Elsie     Kelley     Nigeria
7   Constance       Reid     Nigeria
8          Jo     Fowler     Nigeria
9        Leah     Curtis      Poland
10       Olga    Jimenez     Nigeria
11     Tracey    Barrett     Nigeria
12      Sonia    Gregory     Nigeria
13      Velma      Lucas     Nigeria
14      Brian      Wyman      Poland
15      Frank   Waggoner  Bangladesh
16    Stephen     Qualls  Bangladesh
17    Russell    Brinson      Poland
18     Rodney    Moeller     Nigeria
19      Ruben      Geary      Poland
20     Jimmie  Eggleston      Poland
21    Wallace      Slone     Nigeria
22    Johnnie   Chisholm      Poland
23     Sidney   Burleson      Poland

## Zadanie 8
Gdzie mieszkają członkowie personelu?

In [75]:
df8 = pd.read_sql("select first_name, last_name address, city, district, country from staff left join address on staff.address_id = address.address_id left join city on address.city_id = city.city_id left join country on city.country_id = country.country_id", con=connection)
print(df8)

  first_name   address        city district    country
0       Mike   Hillyer  Lethbridge  Alberta     Canada
1        Jon  Stephens   Woodridge      QLD  Australia

## Zadanie 9
Ilu pracowników mieszka w Argentynie lub Hiszpanii?

In [76]:
df9 = pd.read_sql("select count(*) from country inner join city on city.country_id = country.country_id inner join address on city.city_id = address.city_id inner join staff on address.address_id = staff.address_id where country in ('Argentina', 'Spain')", con=connection)
print(df9)

   count
0      0

## Zadanie 10
Jakie kategorie filmów zostały wypożyczone przez klientów?

In [77]:
df10 = pd.read_sql("select distinct name from category order by name asc", con=connection)
print(df10)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

## Zadanie 11
Wszystkie kategorie filmów wypożyczonych w Ameryce.

In [78]:
df11 = pd.read_sql("SELECT DISTINCT name FROM category inner join film_category on film_category.category_id = category.category_id inner join inventory on film_category.film_id = inventory.film_id inner join rental on rental.inventory_id = inventory.inventory_id inner join customer on customer.customer_id = rental.customer_id inner join address on address.address_id = customer.address_id inner join city on city.city_id = address.city_id inner join country on country.country_id = city.country_id where country.country = 'United States' order by name asc", con=connection)
print(df11)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

## Zadanie 12
Wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley

In [79]:
df12 = pd.read_sql("select distinct title from film inner join film_actor on film_actor.film_id = film.film_id inner join actor  on actor.actor_id = film_actor.actor_id where (first_name = 'Olympia' and last_name = 'Pfeiffer') or (first_name = 'Julia' and last_name = 'Zellweger' ) or (first_name = 'Ellen' and last_name = 'Presley') order by title asc", con=connection)
print(df12)

                   title
0            Badman Dawn
1        Bilko Anonymous
2   Breakfast Goldfinger
3      Caribbean Liberty
4       Casper Dragonfly
..                   ...
64             Turn Star
65            Wait Cider
66          Women Dorado
67             Won Dares
68         Wyoming Storm

[69 rows x 1 columns]